; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p16---int100n150-m25---int100c200---s468---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level9 level9)
(sum level0 level13 level13)
(sum level0 level15 level15)
(sum level0 level18 level18)
(sum level0 level24 level24)
(sum level1 level2 level3)
(sum level1 level9 level10)
(sum level1 level13 level14)
(sum level1 level15 level16)
(sum level1 level18 level19)
(sum level1 level24 level25)
(sum level2 level2 level4)
(sum level2 level9 level11)
(sum level2 level13 level15)
(sum level2 level15 level17)
(sum level2 level18 level20)
(sum level2 level24 level26)
(sum level3 level2 level5)
(sum level3 level9 level12)
(sum level3 level13 level16)
(sum level3 level15 level18)
(sum level3 level18 level21)
(sum level3 level24 level27)
(sum level4 level2 level6)
(sum level4 level9 level13)
(sum level4 level13 level17)
(sum level4 level15 level19)
(sum level4 level18 level22)
(sum level4 level24 level28)
(sum level5 level2 level7)
(sum level5 level9 level14)
(sum level5 level13 level18)
(sum level5 level15 level20)
(sum level5 level18 level23)
(sum level5 level24 level29)
(sum level6 level2 level8)
(sum level6 level9 level15)
(sum level6 level13 level19)
(sum level6 level15 level21)
(sum level6 level18 level24)
(sum level6 level24 level30)
(sum level7 level2 level9)
(sum level7 level9 level16)
(sum level7 level13 level20)
(sum level7 level15 level22)
(sum level7 level18 level25)
(sum level7 level24 level31)
(sum level8 level2 level10)
(sum level8 level9 level17)
(sum level8 level13 level21)
(sum level8 level15 level23)
(sum level8 level18 level26)
(sum level8 level24 level32)
(sum level9 level2 level11)
(sum level9 level9 level18)
(sum level9 level13 level22)
(sum level9 level15 level24)
(sum level9 level18 level27)
(sum level9 level24 level33)
(sum level10 level2 level12)
(sum level10 level9 level19)
(sum level10 level13 level23)
(sum level10 level15 level25)
(sum level10 level18 level28)
(sum level10 level24 level34)
(sum level11 level2 level13)
(sum level11 level9 level20)
(sum level11 level13 level24)
(sum level11 level15 level26)
(sum level11 level18 level29)
(sum level11 level24 level35)
(sum level12 level2 level14)
(sum level12 level9 level21)
(sum level12 level13 level25)
(sum level12 level15 level27)
(sum level12 level18 level30)
(sum level12 level24 level36)
(sum level13 level2 level15)
(sum level13 level9 level22)
(sum level13 level13 level26)
(sum level13 level15 level28)
(sum level13 level18 level31)
(sum level13 level24 level37)
(sum level14 level2 level16)
(sum level14 level9 level23)
(sum level14 level13 level27)
(sum level14 level15 level29)
(sum level14 level18 level32)
(sum level14 level24 level38)
(sum level15 level2 level17)
(sum level15 level9 level24)
(sum level15 level13 level28)
(sum level15 level15 level30)
(sum level15 level18 level33)
(sum level15 level24 level39)
(sum level16 level2 level18)
(sum level16 level9 level25)
(sum level16 level13 level29)
(sum level16 level15 level31)
(sum level16 level18 level34)
(sum level16 level24 level40)
(sum level17 level2 level19)
(sum level17 level9 level26)
(sum level17 level13 level30)
(sum level17 level15 level32)
(sum level17 level18 level35)
(sum level17 level24 level41)
(sum level18 level2 level20)
(sum level18 level9 level27)
(sum level18 level13 level31)
(sum level18 level15 level33)
(sum level18 level18 level36)
(sum level18 level24 level42)
(sum level19 level2 level21)
(sum level19 level9 level28)
(sum level19 level13 level32)
(sum level19 level15 level34)
(sum level19 level18 level37)
(sum level19 level24 level43)
(sum level20 level2 level22)
(sum level20 level9 level29)
(sum level20 level13 level33)
(sum level20 level15 level35)
(sum level20 level18 level38)
(sum level20 level24 level44)
(sum level21 level2 level23)
(sum level21 level9 level30)
(sum level21 level13 level34)
(sum level21 level15 level36)
(sum level21 level18 level39)
(sum level21 level24 level45)
(sum level22 level2 level24)
(sum level22 level9 level31)
(sum level22 level13 level35)
(sum level22 level15 level37)
(sum level22 level18 level40)
(sum level22 level24 level46)
(sum level23 level2 level25)
(sum level23 level9 level32)
(sum level23 level13 level36)
(sum level23 level15 level38)
(sum level23 level18 level41)
(sum level23 level24 level47)
(sum level24 level2 level26)
(sum level24 level9 level33)
(sum level24 level13 level37)
(sum level24 level15 level39)
(sum level24 level18 level42)
(sum level24 level24 level48)
(sum level25 level2 level27)
(sum level25 level9 level34)
(sum level25 level13 level38)
(sum level25 level15 level40)
(sum level25 level18 level43)
(sum level25 level24 level49)
(sum level26 level2 level28)
(sum level26 level9 level35)
(sum level26 level13 level39)
(sum level26 level15 level41)
(sum level26 level18 level44)
(sum level26 level24 level50)
(sum level27 level2 level29)
(sum level27 level9 level36)
(sum level27 level13 level40)
(sum level27 level15 level42)
(sum level27 level18 level45)
(sum level27 level24 level51)
(sum level28 level2 level30)
(sum level28 level9 level37)
(sum level28 level13 level41)
(sum level28 level15 level43)
(sum level28 level18 level46)
(sum level28 level24 level52)
(sum level29 level2 level31)
(sum level29 level9 level38)
(sum level29 level13 level42)
(sum level29 level15 level44)
(sum level29 level18 level47)
(sum level29 level24 level53)
(sum level30 level2 level32)
(sum level30 level9 level39)
(sum level30 level13 level43)
(sum level30 level15 level45)
(sum level30 level18 level48)
(sum level30 level24 level54)
(sum level31 level2 level33)
(sum level31 level9 level40)
(sum level31 level13 level44)
(sum level31 level15 level46)
(sum level31 level18 level49)
(sum level31 level24 level55)
(sum level32 level2 level34)
(sum level32 level9 level41)
(sum level32 level13 level45)
(sum level32 level15 level47)
(sum level32 level18 level50)
(sum level32 level24 level56)
(sum level33 level2 level35)
(sum level33 level9 level42)
(sum level33 level13 level46)
(sum level33 level15 level48)
(sum level33 level18 level51)
(sum level33 level24 level57)
(sum level34 level2 level36)
(sum level34 level9 level43)
(sum level34 level13 level47)
(sum level34 level15 level49)
(sum level34 level18 level52)
(sum level34 level24 level58)
(sum level35 level2 level37)
(sum level35 level9 level44)
(sum level35 level13 level48)
(sum level35 level15 level50)
(sum level35 level18 level53)
(sum level35 level24 level59)
(sum level36 level2 level38)
(sum level36 level9 level45)
(sum level36 level13 level49)
(sum level36 level15 level51)
(sum level36 level18 level54)
(sum level36 level24 level60)
(sum level37 level2 level39)
(sum level37 level9 level46)
(sum level37 level13 level50)
(sum level37 level15 level52)
(sum level37 level18 level55)
(sum level37 level24 level61)
(sum level38 level2 level40)
(sum level38 level9 level47)
(sum level38 level13 level51)
(sum level38 level15 level53)
(sum level38 level18 level56)
(sum level38 level24 level62)
(sum level39 level2 level41)
(sum level39 level9 level48)
(sum level39 level13 level52)
(sum level39 level15 level54)
(sum level39 level18 level57)
(sum level39 level24 level63)
(sum level40 level2 level42)
(sum level40 level9 level49)
(sum level40 level13 level53)
(sum level40 level15 level55)
(sum level40 level18 level58)
(sum level40 level24 level64)
(sum level41 level2 level43)
(sum level41 level9 level50)
(sum level41 level13 level54)
(sum level41 level15 level56)
(sum level41 level18 level59)
(sum level41 level24 level65)
(sum level42 level2 level44)
(sum level42 level9 level51)
(sum level42 level13 level55)
(sum level42 level15 level57)
(sum level42 level18 level60)
(sum level42 level24 level66)
(sum level43 level2 level45)
(sum level43 level9 level52)
(sum level43 level13 level56)
(sum level43 level15 level58)
(sum level43 level18 level61)
(sum level43 level24 level67)
(sum level44 level2 level46)
(sum level44 level9 level53)
(sum level44 level13 level57)
(sum level44 level15 level59)
(sum level44 level18 level62)
(sum level44 level24 level68)
(sum level45 level2 level47)
(sum level45 level9 level54)
(sum level45 level13 level58)
(sum level45 level15 level60)
(sum level45 level18 level63)
(sum level45 level24 level69)
(sum level46 level2 level48)
(sum level46 level9 level55)
(sum level46 level13 level59)
(sum level46 level15 level61)
(sum level46 level18 level64)
(sum level46 level24 level70)
(sum level47 level2 level49)
(sum level47 level9 level56)
(sum level47 level13 level60)
(sum level47 level15 level62)
(sum level47 level18 level65)
(sum level47 level24 level71)
(sum level48 level2 level50)
(sum level48 level9 level57)
(sum level48 level13 level61)
(sum level48 level15 level63)
(sum level48 level18 level66)
(sum level48 level24 level72)
(sum level49 level2 level51)
(sum level49 level9 level58)
(sum level49 level13 level62)
(sum level49 level15 level64)
(sum level49 level18 level67)
(sum level49 level24 level73)
(sum level50 level2 level52)
(sum level50 level9 level59)
(sum level50 level13 level63)
(sum level50 level15 level65)
(sum level50 level18 level68)
(sum level50 level24 level74)
(sum level51 level2 level53)
(sum level51 level9 level60)
(sum level51 level13 level64)
(sum level51 level15 level66)
(sum level51 level18 level69)
(sum level51 level24 level75)
(sum level52 level2 level54)
(sum level52 level9 level61)
(sum level52 level13 level65)
(sum level52 level15 level67)
(sum level52 level18 level70)
(sum level52 level24 level76)
(sum level53 level2 level55)
(sum level53 level9 level62)
(sum level53 level13 level66)
(sum level53 level15 level68)
(sum level53 level18 level71)
(sum level53 level24 level77)
(sum level54 level2 level56)
(sum level54 level9 level63)
(sum level54 level13 level67)
(sum level54 level15 level69)
(sum level54 level18 level72)
(sum level54 level24 level78)
(sum level55 level2 level57)
(sum level55 level9 level64)
(sum level55 level13 level68)
(sum level55 level15 level70)
(sum level55 level18 level73)
(sum level55 level24 level79)
(sum level56 level2 level58)
(sum level56 level9 level65)
(sum level56 level13 level69)
(sum level56 level15 level71)
(sum level56 level18 level74)
(sum level56 level24 level80)
(sum level57 level2 level59)
(sum level57 level9 level66)
(sum level57 level13 level70)
(sum level57 level15 level72)
(sum level57 level18 level75)
(sum level57 level24 level81)
(sum level58 level2 level60)
(sum level58 level9 level67)
(sum level58 level13 level71)
(sum level58 level15 level73)
(sum level58 level18 level76)
(sum level58 level24 level82)
(sum level59 level2 level61)
(sum level59 level9 level68)
(sum level59 level13 level72)
(sum level59 level15 level74)
(sum level59 level18 level77)
(sum level59 level24 level83)
(sum level60 level2 level62)
(sum level60 level9 level69)
(sum level60 level13 level73)
(sum level60 level15 level75)
(sum level60 level18 level78)
(sum level60 level24 level84)
(sum level61 level2 level63)
(sum level61 level9 level70)
(sum level61 level13 level74)
(sum level61 level15 level76)
(sum level61 level18 level79)
(sum level61 level24 level85)
(sum level62 level2 level64)
(sum level62 level9 level71)
(sum level62 level13 level75)
(sum level62 level15 level77)
(sum level62 level18 level80)
(sum level62 level24 level86)
(sum level63 level2 level65)
(sum level63 level9 level72)
(sum level63 level13 level76)
(sum level63 level15 level78)
(sum level63 level18 level81)
(sum level63 level24 level87)
(sum level64 level2 level66)
(sum level64 level9 level73)
(sum level64 level13 level77)
(sum level64 level15 level79)
(sum level64 level18 level82)
(sum level64 level24 level88)
(sum level65 level2 level67)
(sum level65 level9 level74)
(sum level65 level13 level78)
(sum level65 level15 level80)
(sum level65 level18 level83)
(sum level65 level24 level89)
(sum level66 level2 level68)
(sum level66 level9 level75)
(sum level66 level13 level79)
(sum level66 level15 level81)
(sum level66 level18 level84)
(sum level66 level24 level90)
(sum level67 level2 level69)
(sum level67 level9 level76)
(sum level67 level13 level80)
(sum level67 level15 level82)
(sum level67 level18 level85)
(sum level67 level24 level91)
(sum level68 level2 level70)
(sum level68 level9 level77)
(sum level68 level13 level81)
(sum level68 level15 level83)
(sum level68 level18 level86)
(sum level68 level24 level92)
(sum level69 level2 level71)
(sum level69 level9 level78)
(sum level69 level13 level82)
(sum level69 level15 level84)
(sum level69 level18 level87)
(sum level69 level24 level93)
(sum level70 level2 level72)
(sum level70 level9 level79)
(sum level70 level13 level83)
(sum level70 level15 level85)
(sum level70 level18 level88)
(sum level70 level24 level94)
(sum level71 level2 level73)
(sum level71 level9 level80)
(sum level71 level13 level84)
(sum level71 level15 level86)
(sum level71 level18 level89)
(sum level71 level24 level95)
(sum level72 level2 level74)
(sum level72 level9 level81)
(sum level72 level13 level85)
(sum level72 level15 level87)
(sum level72 level18 level90)
(sum level72 level24 level96)
(sum level73 level2 level75)
(sum level73 level9 level82)
(sum level73 level13 level86)
(sum level73 level15 level88)
(sum level73 level18 level91)
(sum level73 level24 level97)
(sum level74 level2 level76)
(sum level74 level9 level83)
(sum level74 level13 level87)
(sum level74 level15 level89)
(sum level74 level18 level92)
(sum level74 level24 level98)
(sum level75 level2 level77)
(sum level75 level9 level84)
(sum level75 level13 level88)
(sum level75 level15 level90)
(sum level75 level18 level93)
(sum level75 level24 level99)
(sum level76 level2 level78)
(sum level76 level9 level85)
(sum level76 level13 level89)
(sum level76 level15 level91)
(sum level76 level18 level94)
(sum level76 level24 level100)
(sum level77 level2 level79)
(sum level77 level9 level86)
(sum level77 level13 level90)
(sum level77 level15 level92)
(sum level77 level18 level95)
(sum level77 level24 level101)
(sum level78 level2 level80)
(sum level78 level9 level87)
(sum level78 level13 level91)
(sum level78 level15 level93)
(sum level78 level18 level96)
(sum level78 level24 level102)
(sum level79 level2 level81)
(sum level79 level9 level88)
(sum level79 level13 level92)
(sum level79 level15 level94)
(sum level79 level18 level97)
(sum level79 level24 level103)
(sum level80 level2 level82)
(sum level80 level9 level89)
(sum level80 level13 level93)
(sum level80 level15 level95)
(sum level80 level18 level98)
(sum level80 level24 level104)
(sum level81 level2 level83)
(sum level81 level9 level90)
(sum level81 level13 level94)
(sum level81 level15 level96)
(sum level81 level18 level99)
(sum level82 level2 level84)
(sum level82 level9 level91)
(sum level82 level13 level95)
(sum level82 level15 level97)
(sum level82 level18 level100)
(sum level83 level2 level85)
(sum level83 level9 level92)
(sum level83 level13 level96)
(sum level83 level15 level98)
(sum level83 level18 level101)
(sum level84 level2 level86)
(sum level84 level9 level93)
(sum level84 level13 level97)
(sum level84 level15 level99)
(sum level84 level18 level102)
(sum level85 level2 level87)
(sum level85 level9 level94)
(sum level85 level13 level98)
(sum level85 level15 level100)
(sum level85 level18 level103)
(sum level86 level2 level88)
(sum level86 level9 level95)
(sum level86 level13 level99)
(sum level86 level15 level101)
(sum level86 level18 level104)
(sum level87 level2 level89)
(sum level87 level9 level96)
(sum level87 level13 level100)
(sum level87 level15 level102)
(sum level88 level2 level90)
(sum level88 level9 level97)
(sum level88 level13 level101)
(sum level88 level15 level103)
(sum level89 level2 level91)
(sum level89 level9 level98)
(sum level89 level13 level102)
(sum level89 level15 level104)
(sum level90 level2 level92)
(sum level90 level9 level99)
(sum level90 level13 level103)
(sum level91 level2 level93)
(sum level91 level9 level100)
(sum level91 level13 level104)
(sum level92 level2 level94)
(sum level92 level9 level101)
(sum level93 level2 level95)
(sum level93 level9 level102)
(sum level94 level2 level96)
(sum level94 level9 level103)
(sum level95 level2 level97)
(sum level95 level9 level104)
(sum level96 level2 level98)
(sum level97 level2 level99)
(sum level98 level2 level100)
(sum level99 level2 level101)
(sum level100 level2 level102)
(sum level101 level2 level103)
(sum level102 level2 level104)

(connected l0 l1)
(fuelcost level18 l0 l1)
(connected l0 l2)
(fuelcost level13 l0 l2)
(connected l0 l3)
(fuelcost level15 l0 l3)
(connected l1 l0)
(fuelcost level18 l1 l0)
(connected l1 l2)
(fuelcost level9 l1 l2)
(connected l1 l3)
(fuelcost level24 l1 l3)
(connected l2 l0)
(fuelcost level13 l2 l0)
(connected l2 l1)
(fuelcost level9 l2 l1)
(connected l2 l3)
(fuelcost level2 l2 l3)
(connected l3 l0)
(fuelcost level15 l3 l0)
(connected l3 l1)
(fuelcost level24 l3 l1)
(connected l3 l2)
(fuelcost level2 l3 l2)

(at t0 l1)
(fuel t0 level104)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l2)
(at p3 l3)
(at p4 l1)
(at p5 l2)
(at p6 l1)
(at p7 l2)
(at p8 l0)
(at p9 l3)
(at p10 l2)
(at p11 l0)
(at p12 l3)
(at p13 l0)
(at p14 l0)
(at p15 l0)
)

(:goal
(and
(at p0 l0)
(at p1 l2)
(at p2 l1)
(at p3 l2)
(at p4 l0)
(at p5 l1)
(at p6 l2)
(at p7 l0)
(at p8 l2)
(at p9 l2)
(at p10 l1)
(at p11 l3)
(at p12 l2)
(at p13 l1)
(at p14 l1)
(at p15 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 16
2. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 16
3. (drive t0 l1 l0 level86 level18 level104)
   deleted: (at t0 l1) (fuel t0 level104)
   added: (at t0 l0) (fuel t0 level86)
   goals met: 0 of 16
4. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 1 of 16
5. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 1 of 16
6. (load p15 t0 l0)
   deleted: (at p15 l0)
   added: (in p15 t0)
   goals met: 1 of 16
7. (load p14 t0 l0)
   deleted: (at p14 l0)
   added: (in p14 t0)
   goals met: 1 of 16
8. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 1 of 16
9. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 1 of 16
10. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 1 of 16
11. (drive t0 l0 l3 level71 level15 level86)
   deleted: (at t0 l0) (fuel t0 level86)
   added: (at t0 l3) (fuel t0 level71)
   goals met: 1 of 16
12. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 2 of 16
13. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 2 of 16
14. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 2 of 16
15. (load p12 t0 l3)
   deleted: (at p12 l3)
   added: (in p12 t0)
   goals met: 2 of 16
16. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 2 of 16
17. (drive t0 l3 l2 level69 level2 level71)
   deleted: (at t0 l3) (fuel t0 level71)
   added: (at t0 l2) (fuel t0 level69)
   goals met: 2 of 16
18. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 3 of 16
19. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 3 of 16
20. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 3 of 16
21. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 3 of 16
22. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 3 of 16
23. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 4 of 16
24. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 5 of 16
25. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 6 of 16
26. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 7 of 16
27. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 8 of 16
28. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 9 of 16
29. (drive t0 l2 l0 level56 level13 level69)
   deleted: (at t0 l2) (fuel t0 level69)
   added: (at t0 l0) (fuel t0 level56)
   goals met: 9 of 16
30. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 10 of 16
31. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 11 of 16
32. (drive t0 l0 l1 level38 level18 level56)
   deleted: (at t0 l0) (fuel t0 level56)
   added: (at t0 l1) (fuel t0 level38)
   goals met: 11 of 16
33. (unload p10 t0 l1)
   deleted: (in p10 t0)
   added: (at p10 l1)
   goals met: 12 of 16
34. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 13 of 16
35. (unload p14 t0 l1)
   deleted: (in p14 t0)
   added: (at p14 l1)
   goals met: 14 of 16
36. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 15 of 16
37. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 16 of 16
